## 결측처리_30216_이창현

In [1]:
import pandas as pd

In [2]:
path = '데이터.csv'

In [4]:
path

'데이터.csv'

In [8]:
df=pd.read_csv(path, encoding = 'cp949')

In [10]:
df

      학번    이름   국어  수학    영어    과학
0  30201   1유현  100  80  55.0  55.0
1  30202   2유현   95  78   NaN   NaN
2  30203   3유현   90  76   NaN   NaN
3  30204   4유현   85  74   NaN   NaN
4  30205   5유현   80  72   NaN   NaN
5  30206   6유현   75  70   NaN  63.0
6  30207   7유현   70  68  67.0  67.0
7  30208   8유현   65  66   NaN   NaN
8  30209   9유현   60  64   NaN   NaN
9  30210  10유현   55  62  73.0  73.0

In [12]:
df.head()

      학번   이름   국어  수학    영어    과학
0  30201  1유현  100  80  55.0  55.0
1  30202  2유현   95  78   NaN   NaN
2  30203  3유현   90  76   NaN   NaN
3  30204  4유현   85  74   NaN   NaN
4  30205  5유현   80  72   NaN   NaN

In [14]:
df.tail()

      학번    이름  국어  수학    영어    과학
5  30206   6유현  75  70   NaN  63.0
6  30207   7유현  70  68  67.0  67.0
7  30208   8유현  65  66   NaN   NaN
8  30209   9유현  60  64   NaN   NaN
9  30210  10유현  55  62  73.0  73.0

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
학번    10 non-null int64
이름    10 non-null object
국어    10 non-null int64
수학    10 non-null int64
영어    3 non-null float64
과학    4 non-null float64
dtypes: float64(2), int64(3), object(1)
memory usage: 608.0+ bytes

In [19]:
df.shape

(10, 6)

In [39]:
df.sample()

      학번   이름   국어  수학    영어    과학
0  30201  1유현  100  80  55.0  55.0

In [41]:
df.columns

Index(['학번', '이름', '국어', '수학', '영어', '과학'], dtype='object')

In [43]:
df.dtypes

학번      int64
이름     object
국어      int64
수학      int64
영어    float64
과학    float64
dtype: object

In [47]:
df.isnull()

      학번     이름     국어     수학     영어     과학
0  False  False  False  False  False  False
1  False  False  False  False   True   True
2  False  False  False  False   True   True
3  False  False  False  False   True   True
4  False  False  False  False   True   True
5  False  False  False  False   True  False
6  False  False  False  False  False  False
7  False  False  False  False   True   True
8  False  False  False  False   True   True
9  False  False  False  False  False  False

In [49]:
df.isnull().sum()

학번    0
이름    0
국어    0
수학    0
영어    7
과학    6
dtype: int64

In [59]:
df_null_count = df.isnull().sum()

In [67]:
df_null_count = null_count.reset_index()

In [68]:
df_null_count

  index  0
0    학번  0
1    이름  0
2    국어  0
3    수학  0
4    영어  7
5    과학  6

In [69]:
df_null_count.columns=['메뉴', '결측']

In [72]:
df_null_count

   메뉴  결측
0  학번   0
1  이름   0
2  국어   0
3  수학   0
4  영어   7
5  과학   6

In [74]:
df_null_count_3 = df_null_count.sort_values(by='결측',ascending=False).head(3)

In [77]:
df_null_count_3

   메뉴  결측
4  영어   7
5  과학   6
0  학번   0

In [79]:
drop_columns = df_null_count_3['메뉴']

In [81]:
drop_columns

4    영어
5    과학
0    학번
Name: 메뉴, dtype: object

In [83]:
drop_columns.to_list()

['영어', '과학', '학번']

In [85]:
df[drop_columns]

     영어    과학     학번
0  55.0  55.0  30201
1   NaN   NaN  30202
2   NaN   NaN  30203
3   NaN   NaN  30204
4   NaN   NaN  30205
5   NaN  63.0  30206
6  67.0  67.0  30207
7   NaN   NaN  30208
8   NaN   NaN  30209
9  73.0  73.0  30210

In [87]:
print(df.shape)

(10, 6)

In [92]:
df.head()

      학번   이름   국어  수학    영어    과학
0  30201  1유현  100  80  55.0  55.0
1  30202  2유현   95  78   NaN   NaN
2  30203  3유현   90  76   NaN   NaN
3  30204  4유현   85  74   NaN   NaN
4  30205  5유현   80  72   NaN   NaN

In [96]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
학번    10 non-null int64
이름    10 non-null object
국어    10 non-null int64
수학    10 non-null int64
영어    3 non-null float64
과학    4 non-null float64
dtypes: float64(2), int64(3), object(1)
memory usage: 608.0+ bytes

In [98]:
df.drop(drop_columns,axis=1)

     이름   국어  수학
0   1유현  100  80
1   2유현   95  78
2   3유현   90  76
3   4유현   85  74
4   5유현   80  72
5   6유현   75  70
6   7유현   70  68
7   8유현   65  66
8   9유현   60  64
9  10유현   55  62

In [101]:
df_5=df.drop(drop_columns,axis=1)
df_5

     이름   국어  수학
0   1유현  100  80
1   2유현   95  78
2   3유현   90  76
3   4유현   85  74
4   5유현   80  72
5   6유현   75  70
6   7유현   70  68
7   8유현   65  66
8   9유현   60  64
9  10유현   55  62

In [102]:
df_5.shape

(10, 3)